
1. DEFINE A PANDAS DATAFRAME

In [1]:
#Series in pandas is one dimensional whereas the pandas dataframe is multifunctional
import pandas as pd

In [2]:
# Let's define a two-dimensional Pandas DataFrame
# Note that you can create a pandas dataframe from a python dictionary
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name': ['Nihar','Nikhil','Nirup','Gaurav'],
                               'Net Worth[$]':[35000, 3000, 100000, 2000],
                               'Years with BANK':[4,7,8,15]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth[$]  Years with BANK
0             111            Nihar         35000                4
1             222           Nikhil          3000                7
2             333            Nirup        100000                8
3             444           Gaurav          2000               15

In [4]:
# Let's obtain the data type 
type(bank_client_df)

pandas.core.frame.DataFrame

In [5]:
# you can only view the first couple of rows using .head()
bank_client_df.head()

   Bank Client ID Bank Client Name  Net Worth[$]  Years with BANK
0             111            Nihar         35000                4
1             222           Nikhil          3000                7
2             333            Nirup        100000                8
3             444           Gaurav          2000               15

In [6]:
# you can only view the last couple of rows using .tail()
bank_client_df.tail()

   Bank Client ID Bank Client Name  Net Worth[$]  Years with BANK
0             111            Nihar         35000                4
1             222           Nikhil          3000                7
2             333            Nirup        100000                8
3             444           Gaurav          2000               15

In [8]:
# You can obtain the shape of the DataFrame (#rows, #columns)
bank_client_df.shape

(4, 4)

In [9]:
# Obtain DataFrame information 
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Bank Client ID    4 non-null      int64
 1   Bank Client Name  4 non-null      object
 2   Net Worth[$]      4 non-null      int64
 3   Years with BANK   4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

**MINI CHALLENGE #1:**
- **A porfolio contains a collection of securities such as stocks, bonds and ETFs. Define a dataframe named 'portfolio_df' that holds 3 different stock ticker symbols, number of shares, and price per share (feel free to choose any stocks)**
- **Calculate the total value of the porfolio including all stocks**

In [10]:
portfolio_df = pd.DataFrame({'Stocks':['apple','amazon','google','tesla'],
                             'Ticker':['app','amz','ggl','tsl'],
                             'Number of shares':[30,50,70,100],
                             'Share price':[202,175,160,240],})
portfolio_df

   Stocks Ticker  Number of shares  Share price
0   apple    app                30          202
1  amazon    amz                50          175
2  google    ggl                70          160
3   tesla    tsl               100          240

In [15]:
ab = portfolio_df['Share price']

In [16]:
bc = portfolio_df['Number of shares']

In [17]:
stocks_dollar_value = ab*bc
stocks_dollar_value

0     6060
1     8750
2    11200
3    24000
dtype: int64

In [18]:
stocks_dollar_value.sum()

50010

# 2. INPUTS (READ CSV AND HTML DATA)

In [23]:
# Pandas is used to read a csv file and store data in a DataFrame
ssup = pd.read_csv('N:\Personal Learning\Pandas\Pandas_Series\S_P500_Prices.csv')
ssup

            sp500
0     1295.500000
1     1289.089966
2     1293.670044
3     1308.040039
4     1314.500000
...           ...
2154  3327.770020
2155  3349.159912
2156  3351.280029
2157  3360.469971
2158  3333.689941

[2159 rows x 1 columns]

In [21]:
# Read tabular data using read_html
house_prices_df = pd.read_html(' https://www.ssa.gov/oact/progdata/nra.html')
house_prices_df[0]

,Year of birth,Age
0,1937 and prior,65
1,1938,65 and 2 months
2,1939,65 and 4 months
3,1940,65 and 6 months
4,1941,65 and 8 months
5,1942,65 and 10 months
6,1943-54,66
7,1955,66 and 2 months
8,1956,66 and 4 months
9,1957,66 and 6 months
10,1958,66 and 8 months
11,1959,66 and 10 months
12,1960 and later,67
13,Notes: 1. Persons born on January 1 of any yea...,Notes: 1. Persons born on January 1 of any yea...